GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.h
// Register: MD1CON1
#define MD1CON1 MD1CON1
extern volatile unsigned char           MD1CON1             __at(0x3CFB);
#ifndef _LIB_BUILD
asm("MD1CON1 equ 03CFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLSYNC                 :1;
        unsigned CLPOL                  :1;
        unsigned                        :2;
        unsigned CHSYNC                 :1;
        unsigned CHPOL                  :1;
    };
    struct {
        unsigned MD1CLSYNC              :1;
        unsigned MD1CLPOL               :1;
        unsigned                        :2;
        unsigned MD1CHSYNC              :1;
        unsigned MD1CHPOL               :1;
    };
} MD1CON1bits_t;
extern volatile MD1CON1bits_t MD1CON1bits __at(0x3CFB);
// bitfield macros
#define _MD1CON1_CLSYNC_POSN                                0x0
#define _MD1CON1_CLSYNC_POSITION                            0x0
#define _MD1CON1_CLSYNC_SIZE                                0x1
#define _MD1CON1_CLSYNC_LENGTH                              0x1
#define _MD1CON1_CLSYNC_MASK                                0x1
#define _MD1CON1_CLPOL_POSN                                 0x1
#define _MD1CON1_CLPOL_POSITION                             0x1
#define _MD1CON1_CLPOL_SIZE                                 0x1
#define _MD1CON1_CLPOL_LENGTH                               0x1
#define _MD1CON1_CLPOL_MASK                                 0x2
#define _MD1CON1_CHSYNC_POSN                                0x4
#define _MD1CON1_CHSYNC_POSITION                            0x4
#define _MD1CON1_CHSYNC_SIZE                                0x1
#define _MD1CON1_CHSYNC_LENGTH                              0x1
#define _MD1CON1_CHSYNC_MASK                                0x10
#define _MD1CON1_CHPOL_POSN                                 0x5
#define _MD1CON1_CHPOL_POSITION                             0x5
#define _MD1CON1_CHPOL_SIZE                                 0x1
#define _MD1CON1_CHPOL_LENGTH                               0x1
#define _MD1CON1_CHPOL_MASK                                 0x20
#define _MD1CON1_MD1CLSYNC_POSN                             0x0
#define _MD1CON1_MD1CLSYNC_POSITION                         0x0
#define _MD1CON1_MD1CLSYNC_SIZE                             0x1
#define _MD1CON1_MD1CLSYNC_LENGTH                           0x1
#define _MD1CON1_MD1CLSYNC_MASK                             0x1
#define _MD1CON1_MD1CLPOL_POSN                              0x1
#define _MD1CON1_MD1CLPOL_POSITION                          0x1
#define _MD1CON1_MD1CLPOL_SIZE                              0x1
#define _MD1CON1_MD1CLPOL_LENGTH                            0x1
#define _MD1CON1_MD1CLPOL_MASK                              0x2
#define _MD1CON1_MD1CHSYNC_POSN                             0x4
#define _MD1CON1_MD1CHSYNC_POSITION                         0x4
#define _MD1CON1_MD1CHSYNC_SIZE                             0x1
#define _MD1CON1_MD1CHSYNC_LENGTH                           0x1
#define _MD1CON1_MD1CHSYNC_MASK                             0x10
#define _MD1CON1_MD1CHPOL_POSN                              0x5
#define _MD1CON1_MD1CHPOL_POSITION                          0x5
#define _MD1CON1_MD1CHPOL_SIZE                              0x1
#define _MD1CON1_MD1CHPOL_LENGTH                            0x1
#define _MD1CON1_MD1CHPOL_MASK                              0x20

// Register: MD1SRC
#define MD1SRC MD1SRC
extern volatile unsigned char           MD1SRC              __at(0x3CFC);
#ifndef _LIB_BUILD
asm("MD1SRC equ 03CFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MS                     :5;
    };
    struct {
        unsigned MS0                    :1;
        unsigned MS1                    :1;
        unsigned MS2                    :1;
        unsigned MS3                    :1;
        unsigned MS4                    :1;
    };
    struct {
        unsigned MD1MS                  :5;
    };
    struct {
        unsigned MD1MS0                 :1;
        unsigned MD1MS1                 :1;
        unsigned MD1MS2                 :1;
        unsigned MD1MS3                 :1;
        unsigned MD1MS4                 :1;
    };
} MD1SRCbits_t;
extern volatile MD1SRCbits_t MD1SRCbits __at(0x3CFC);
// bitfield macros
#define _MD1SRC_MS_POSN                                     0x0
#define _MD1SRC_MS_POSITION                                 0x0
#define _MD1SRC_MS_SIZE                                     0x5
#define _MD1SRC_MS_LENGTH                                   0x5
#define _MD1SRC_MS_MASK                                     0x1F
#define _MD1SRC_MS0_POSN                                    0x0
#define _MD1SRC_MS0_POSITION                                0x0
#define _MD1SRC_MS0_SIZE                                    0x1
#define _MD1SRC_MS0_LENGTH                                  0x1
#define _MD1SRC_MS0_MASK                                    0x1
#define _MD1SRC_MS1_POSN                                    0x1
#define _MD1SRC_MS1_POSITION                                0x1
#define _MD1SRC_MS1_SIZE                                    0x1
#define _MD1SRC_MS1_LENGTH                                  0x1
#define _MD1SRC_MS1_MASK                                    0x2
#define _MD1SRC_MS2_POSN                                    0x2
#define _MD1SRC_MS2_POSITION                                0x2
#define _MD1SRC_MS2_SIZE                                    0x1
#define _MD1SRC_MS2_LENGTH                                  0x1
#define _MD1SRC_MS2_MASK                                    0x4
#define _MD1SRC_MS3_POSN                                    0x3
#define _MD1SRC_MS3_POSITION                                0x3
#define _MD1SRC_MS3_SIZE                                    0x1
#define _MD1SRC_MS3_LENGTH                                  0x1
#define _MD1SRC_MS3_MASK                                    0x8
#define _MD1SRC_MS4_POSN                                    0x4
#define _MD1SRC_MS4_POSITION                                0x4
#define _MD1SRC_MS4_SIZE                                    0x1
#define _MD1SRC_MS4_LENGTH                                  0x1
#define _MD1SRC_MS4_MASK                                    0x10
#define _MD1SRC_MD1MS_POSN                                  0x0
#define _MD1SRC_MD1MS_POSITION                              0x0
#define _MD1SRC_MD1MS_SIZE                                  0x5
#define _MD1SRC_MD1MS_LENGTH                                0x5
#define _MD1SRC_MD1MS_MASK                                  0x1F
#define _MD1SRC_MD1MS0_POSN                                 0x0
#define _MD1SRC_MD1MS0_POSITION                             0x0
#define _MD1SRC_MD1MS0_SIZE                                 0x1
#define _MD1SRC_MD1MS0_LENGTH                               0x1
#define _MD1SRC_MD1MS0_MASK                                 0x1
#define _MD1SRC_MD1MS1_POSN                                 0x1
#define _MD1SRC_MD1MS1_POSITION                             0x1
#define _MD1SRC_MD1MS1_SIZE                                 0x1
#define _MD1SRC_MD1MS1_LENGTH                               0x1
#define _MD1SRC_MD1MS1_MASK                                 0x2
#define _MD1SRC_MD1MS2_POSN                                 0x2
#define _MD1SRC_MD1MS2_POSITION                             0x2
#define _MD1SRC_MD1MS2_SIZE                                 0x1
#define _MD1SRC_MD1MS2_LENGTH                               0x1
#define _MD1SRC_MD1MS2_MASK                                 0x4
#define _MD1SRC_MD1MS3_POSN                                 0x3
#define _MD1SRC_MD1MS3_POSITION                             0x3
#define _MD1SRC_MD1MS3_SIZE                                 0x1
#define _MD1SRC_MD1MS3_LENGTH                               0x1
#define _MD1SRC_MD1MS3_MASK                                 0x8
#define _MD1SRC_MD1MS4_POSN                                 0x4
#define _MD1SRC_MD1MS4_POSITION                             0x4
#define _MD1SRC_MD1MS4_SIZE                                 0x1
#define _MD1SRC_MD1MS4_LENGTH                               0x1
#define _MD1SRC_MD1MS4_MASK                                 0x10

// Register: MD1CARL
#define MD1CARL MD1CARL
extern volatile unsigned char           MD1CARL             __at(0x3CFD);
#ifndef _LIB_BUILD
asm("MD1CARL equ 03CFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CL                     :5;
    };
    struct {
        unsigned CL0                    :1;
        unsigned CL1                    :1;
        unsigned CL2                    :1;
        unsigned CL3                    :1;
        unsigned CL4                    :1;
    };
    struct {
        unsigned MD1CL                  :5;
    };
    struct {
        unsigned MD1CL0                 :1;
        unsigned MD1CL1                 :1;
        unsigned MD1CL2                 :1;
        unsigned MD1CL3                 :1;
        unsigned MD1CL4                 :1;
    };
} MD1CARLbits_t;
extern volatile MD1CARLbits_t MD1CARLbits __at(0x3CFD);
// bitfield macros
#define _MD1CARL_CL_POSN                                    0x0
#define _MD1CARL_CL_POSITION                                0x0
#define _MD1CARL_CL_SIZE                                    0x5
#define _MD1CARL_CL_LENGTH                                  0x5
#define _MD1CARL_CL_MASK                                    0x1F
#define _MD1CARL_CL0_POSN                                   0x0
#define _MD1CARL_CL0_POSITION                               0x0
#define _MD1CARL_CL0_SIZE                                   0x1
#define _MD1CARL_CL0_LENGTH                                 0x1
#define _MD1CARL_CL0_MASK                                   0x1
#define _MD1CARL_CL1_POSN                                   0x1
#define _MD1CARL_CL1_POSITION                               0x1
#define _MD1CARL_CL1_SIZE                                   0x1
#define _MD1CARL_CL1_LENGTH                                 0x1
#define _MD1CARL_CL1_MASK                                   0x2
#define _MD1CARL_CL2_POSN                                   0x2
#define _MD1CARL_CL2_POSITION                               0x2
#define _MD1CARL_CL2_SIZE                                   0x1
#define _MD1CARL_CL2_LENGTH                                 0x1
#define _MD1CARL_CL2_MASK                                   0x4
#define _MD1CARL_CL3_POSN                                   0x3
#define _MD1CARL_CL3_POSITION                               0x3
#define _MD1CARL_CL3_SIZE                                   0x1
#define _MD1CARL_CL3_LENGTH                                 0x1
#define _MD1CARL_CL3_MASK                                   0x8
#define _MD1CARL_CL4_POSN                                   0x4
#define _MD1CARL_CL4_POSITION                               0x4
#define _MD1CARL_CL4_SIZE                                   0x1
#define _MD1CARL_CL4_LENGTH                                 0x1
#define _MD1CARL_CL4_MASK                                   0x10
#define _MD1CARL_MD1CL_POSN                                 0x0
#define _MD1CARL_MD1CL_POSITION                             0x0
#define _MD1CARL_MD1CL_SIZE                                 0x5
#define _MD1CARL_MD1CL_LENGTH                               0x5
#define _MD1CARL_MD1CL_MASK                                 0x1F
#define _MD1CARL_MD1CL0_POSN                                0x0
#define _MD1CARL_MD1CL0_POSITION                            0x0
#define _MD1CARL_MD1CL0_SIZE                                0x1
#define _MD1CARL_MD1CL0_LENGTH                              0x1
#define _MD1CARL_MD1CL0_MASK                                0x1
#define _MD1CARL_MD1CL1_POSN                                0x1
#define _MD1CARL_MD1CL1_POSITION                            0x1
#define _MD1CARL_MD1CL1_SIZE                                0x1
#define _MD1CARL_MD1CL1_LENGTH                              0x1
#define _MD1CARL_MD1CL1_MASK                                0x2
#define _MD1CARL_MD1CL2_POSN                                0x2
#define _MD1CARL_MD1CL2_POSITION                            0x2
#define _MD1CARL_MD1CL2_SIZE                                0x1
#define _MD1CARL_MD1CL2_LENGTH                              0x1
#define _MD1CARL_MD1CL2_MASK                                0x4
#define _MD1CARL_MD1CL3_POSN                                0x3
#define _MD1CARL_MD1CL3_POSITION                            0x3
#define _MD1CARL_MD1CL3_SIZE                                0x1
#define _MD1CARL_MD1CL3_LENGTH                              0x1
#define _MD1CARL_MD1CL3_MASK                                0x8
#define _MD1CARL_MD1CL4_POSN                                0x4
#define _MD1CARL_MD1CL4_POSITION                            0x4
#define _MD1CARL_MD1CL4_SIZE                                0x1
#define _MD1CARL_MD1CL4_LENGTH                              0x1
#define _MD1CARL_MD1CL4_MASK                                0x10

// Register: MD1CARH
#define MD1CARH MD1CARH
extern volatile unsigned char           MD1CARH             __at(0x3CFE);
#ifndef _LIB_BUILD
asm("MD1CARH equ 03CFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH                     :5;
    };
    struct {
        unsigned CH0                    :1;
        unsigned CH1                    :1;
        unsigned CH2                    :1;
        unsigned CH3                    :1;
        unsigned CH4                    :1;
    };
    struct {
        unsigned MD1CH                  :5;
    };
    struct {
        unsigned MD1CH0                 :1;
        unsigned MD1CH1                 :1;
        unsigned MD1CH2                 :1;
        unsigned MD1CH3                 :1;
        unsigned MD1CH4                 :1;
    };
} MD1CARHbits_t;
extern volatile MD1CARHbits_t MD1CARHbits __at(0x3CFE);
// bitfield macros
#define _MD1CARH_CH_POSN                                    0x0
#define _MD1CARH_CH_POSITION                                0x0
#define _MD1CARH_CH_SIZE                                    0x5
#define _MD1CARH_CH_LENGTH                                  0x5
#define _MD1CARH_CH_MASK                                    0x1F
#define _MD1CARH_CH0_POSN                                   0x0
#define _MD1CARH_CH0_POSITION                               0x0
#define _MD1CARH_CH0_SIZE                                   0x1
#define _MD1CARH_CH0_LENGTH                                 0x1
#define _MD1CARH_CH0_MASK                                   0x1
#define _MD1CARH_CH1_POSN                                   0x1
#define _MD1CARH_CH1_POSITION                               0x1
#define _MD1CARH_CH1_SIZE                                   0x1
#define _MD1CARH_CH1_LENGTH                                 0x1
#define _MD1CARH_CH1_MASK                                   0x2
#define _MD1CARH_CH2_POSN                                   0x2
#define _MD1CARH_CH2_POSITION                               0x2
#define _MD1CARH_CH2_SIZE                                   0x1
#define _MD1CARH_CH2_LENGTH                                 0x1
#define _MD1CARH_CH2_MASK                                   0x4
#define _MD1CARH_CH3_POSN                                   0x3
#define _MD1CARH_CH3_POSITION                               0x3
#define _MD1CARH_CH3_SIZE                                   0x1
#define _MD1CARH_CH3_LENGTH                                 0x1
#define _MD1CARH_CH3_MASK                                   0x8
#define _MD1CARH_CH4_POSN                                   0x4
#define _MD1CARH_CH4_POSITION                               0x4
#define _MD1CARH_CH4_SIZE                                   0x1
#define _MD1CARH_CH4_LENGTH                                 0x1
#define _MD1CARH_CH4_MASK                                   0x10
#define _MD1CARH_MD1CH_POSN                                 0x0
#define _MD1CARH_MD1CH_POSITION                             0x0
#define _MD1CARH_MD1CH_SIZE                                 0x5
#define _MD1CARH_MD1CH_LENGTH                               0x5
#define _MD1CARH_MD1CH_MASK                                 0x1F
#define _MD1CARH_MD1CH0_POSN                                0x0
#define _MD1CARH_MD1CH0_POSITION                            0x0
#define _MD1CARH_MD1CH0_SIZE                                0x1
#define _MD1CARH_MD1CH0_LENGTH                              0x1
#define _MD1CARH_MD1CH0_MASK                                0x1
#define _MD1CARH_MD1CH1_POSN                                0x1
#define _MD1CARH_MD1CH1_POSITION                            0x1
#define _MD1CARH_MD1CH1_SIZE                                0x1
#define _MD1CARH_MD1CH1_LENGTH                              0x1
#define _MD1CARH_MD1CH1_MASK                                0x2
#define _MD1CARH_MD1CH2_POSN                                0x2
#define _MD1CARH_MD1CH2_POSITION                            0x2
#define _MD1CARH_MD1CH2_SIZE                                0x1
#define _MD1CARH_MD1CH2_LENGTH                              0x1
#define _MD1CARH_MD1CH2_MASK                                0x4
#define _MD1CARH_MD1CH3_POSN                                0x3
#define _MD1CARH_MD1CH3_POSITION                            0x3
#define _MD1CARH_MD1CH3_SIZE                                0x1
#define _MD1CARH_MD1CH3_LENGTH                              0x1
#define _MD1CARH_MD1CH3_MASK                                0x8
#define _MD1CARH_MD1CH4_POSN                                0x4
#define _MD1CARH_MD1CH4_POSITION                            0x4
#define _MD1CARH_MD1CH4_SIZE                                0x1
#define _MD1CARH_MD1CH4_LENGTH                              0x1
#define _MD1CARH_MD1CH4_MASK                                0x10

// Register: SPI1RXB
#define SPI1RXB SPI1RXB
extern volatile unsigned char           SPI1RXB             __at(0x3D10);
#ifndef _LIB_BUILD
asm("SPI1RXB equ 03D10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
    struct {
        unsigned RXB0                   :1;
        unsigned RXB1                   :1;
        unsigned RXB2                   :1;
        unsigned RXB3                   :1;
        unsigned RXB4                   :1;
        unsigned RXB5                   :1;
        unsigned RXB6                   :1;
        unsigned RXB7                   :1;
    };
} SPI1RXBbits_t;
extern volatile SPI1RXBbits_t SPI1RXBbits __at(0x3D10);
// bitfield macros
#define _SPI1RXB_RXB_POSN                                   0x0
#define _SPI1RXB_RXB_POSITION                               0x0
#define _SPI1RXB_RXB_SIZE                                   0x8
#define _SPI1RXB_RXB_LENGTH                                 0x8
#define _SPI1RXB_RXB_MASK                                   0xFF
#define _SPI1RXB_RXB0_POSN                                  0x0
#define _SPI1RXB_RXB0_POSITION                              0x0
#define _SPI1RXB_RXB0_SIZE                                  0x1
#define _SPI1RXB_RXB0_LENGTH                                0x1
#define _SPI1RXB_RXB0_MASK                                  0x1
#define _SPI1RXB_RXB1_POSN                                  0x1
#define _SPI1RXB_RXB1_POSITION                              0x1
#define _SPI1RXB_RXB1_SIZE                                  0x1
#define _SPI1RXB_RXB1_LENGTH                                0x1
#define _SPI1RXB_RXB1_MASK                                  0x2
#define _SPI1RXB_RXB2_POSN                                  0x2
#define _SPI1RXB_RXB2_POSITION                              0x2
#define _SPI1RXB_RXB2_SIZE                                  0x1
#define _SPI1RXB_RXB2_LENGTH                                0x1
#define _SPI1RXB_RXB2_MASK                                  0x4
#define _SPI1RXB_RXB3_POSN                                  0x3
#define _SPI1RXB_RXB3_POSITION                              0x3
#define _SPI1RXB_RXB3_SIZE                                  0x1
#define _SPI1RXB_RXB3_LENGTH                                0x1
#define _SPI1RXB_RXB3_MASK                                  0x8
#define _SPI1RXB_RXB4_POSN                                  0x4
#define _SPI1RXB_RXB4_POSITION                              0x4
#define _SPI1RXB_RXB4_SIZE                                  0x1
#define _SPI1RXB_RXB4_LENGTH                                0x1
#define _SPI1RXB_RXB4_MASK                                  0x10
#define _SPI1RXB_RXB5_POSN                                  0x5
#define _SPI1RXB_RXB5_POSITION                              0x5
#define _SPI1RXB_RXB5_SIZE                                  0x1
#define _SPI1RXB_RXB5_LENGTH                                0x1
#define _SPI1RXB_RXB5_MASK                                  0x20
#define _SPI1RXB_RXB6_POSN                                  0x6
#define _SPI1RXB_RXB6_POSITION                              0x6
#define _SPI1RXB_RXB6_SIZE                                  0x1
#define _SPI1RXB_RXB6_LENGTH                                0x1
#define _SPI1RXB_RXB6_MASK                                  0x40
#define _SPI1RXB_RXB7_POSN                                  0x7
#define _SPI1RXB_RXB7_POSITION                              0x7
#define _SPI1RXB_RXB7_SIZE                                  0x1
#define _SPI1RXB_RXB7_LENGTH                                0x1
#define _SPI1RXB_RXB7_MASK                                  0x80

// Register: SPI1TXB
#define SPI1TXB SPI1TXB
extern volatile unsigned char           SPI1TXB             __at(0x3D11);
#ifndef _LIB_BUILD
asm("SPI1TXB equ 03D11h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
    struct {
        unsigned TXB0                   :1;
        unsigned TXB1                   :1;
        unsigned TXB2                   :1;
        unsigned TXB3                   :1;
        unsigned TXB4                   :1;
        unsigned TXB5                   :1;
        unsigned TXB6                   :1;
        unsigned TXB7                   :1;
    };
} SPI1TXBbits_t;
