GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.h
// Register: I2C1PIE
#define I2C1PIE I2C1PIE
extern volatile unsigned char           I2C1PIE             __at(0x3D7A);
#ifndef _LIB_BUILD
asm("I2C1PIE equ 03D7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIE                   :1;
        unsigned RSCIE                  :1;
        unsigned PCIE                   :1;
        unsigned ADRIE                  :1;
        unsigned WRIE                   :1;
        unsigned                        :1;
        unsigned ACKTIE                 :1;
        unsigned CNTIE                  :1;
    };
    struct {
        unsigned SC1IE                  :1;
        unsigned RSC1IE                 :1;
        unsigned PC1IE                  :1;
        unsigned ADR1IE                 :1;
        unsigned WR1IE                  :1;
        unsigned                        :1;
        unsigned ACKT1IE                :1;
        unsigned CNT1IE                 :1;
    };
} I2C1PIEbits_t;
extern volatile I2C1PIEbits_t I2C1PIEbits __at(0x3D7A);
// bitfield macros
#define _I2C1PIE_SCIE_POSN                                  0x0
#define _I2C1PIE_SCIE_POSITION                              0x0
#define _I2C1PIE_SCIE_SIZE                                  0x1
#define _I2C1PIE_SCIE_LENGTH                                0x1
#define _I2C1PIE_SCIE_MASK                                  0x1
#define _I2C1PIE_RSCIE_POSN                                 0x1
#define _I2C1PIE_RSCIE_POSITION                             0x1
#define _I2C1PIE_RSCIE_SIZE                                 0x1
#define _I2C1PIE_RSCIE_LENGTH                               0x1
#define _I2C1PIE_RSCIE_MASK                                 0x2
#define _I2C1PIE_PCIE_POSN                                  0x2
#define _I2C1PIE_PCIE_POSITION                              0x2
#define _I2C1PIE_PCIE_SIZE                                  0x1
#define _I2C1PIE_PCIE_LENGTH                                0x1
#define _I2C1PIE_PCIE_MASK                                  0x4
#define _I2C1PIE_ADRIE_POSN                                 0x3
#define _I2C1PIE_ADRIE_POSITION                             0x3
#define _I2C1PIE_ADRIE_SIZE                                 0x1
#define _I2C1PIE_ADRIE_LENGTH                               0x1
#define _I2C1PIE_ADRIE_MASK                                 0x8
#define _I2C1PIE_WRIE_POSN                                  0x4
#define _I2C1PIE_WRIE_POSITION                              0x4
#define _I2C1PIE_WRIE_SIZE                                  0x1
#define _I2C1PIE_WRIE_LENGTH                                0x1
#define _I2C1PIE_WRIE_MASK                                  0x10
#define _I2C1PIE_ACKTIE_POSN                                0x6
#define _I2C1PIE_ACKTIE_POSITION                            0x6
#define _I2C1PIE_ACKTIE_SIZE                                0x1
#define _I2C1PIE_ACKTIE_LENGTH                              0x1
#define _I2C1PIE_ACKTIE_MASK                                0x40
#define _I2C1PIE_CNTIE_POSN                                 0x7
#define _I2C1PIE_CNTIE_POSITION                             0x7
#define _I2C1PIE_CNTIE_SIZE                                 0x1
#define _I2C1PIE_CNTIE_LENGTH                               0x1
#define _I2C1PIE_CNTIE_MASK                                 0x80
#define _I2C1PIE_SC1IE_POSN                                 0x0
#define _I2C1PIE_SC1IE_POSITION                             0x0
#define _I2C1PIE_SC1IE_SIZE                                 0x1
#define _I2C1PIE_SC1IE_LENGTH                               0x1
#define _I2C1PIE_SC1IE_MASK                                 0x1
#define _I2C1PIE_RSC1IE_POSN                                0x1
#define _I2C1PIE_RSC1IE_POSITION                            0x1
#define _I2C1PIE_RSC1IE_SIZE                                0x1
#define _I2C1PIE_RSC1IE_LENGTH                              0x1
#define _I2C1PIE_RSC1IE_MASK                                0x2
#define _I2C1PIE_PC1IE_POSN                                 0x2
#define _I2C1PIE_PC1IE_POSITION                             0x2
#define _I2C1PIE_PC1IE_SIZE                                 0x1
#define _I2C1PIE_PC1IE_LENGTH                               0x1
#define _I2C1PIE_PC1IE_MASK                                 0x4
#define _I2C1PIE_ADR1IE_POSN                                0x3
#define _I2C1PIE_ADR1IE_POSITION                            0x3
#define _I2C1PIE_ADR1IE_SIZE                                0x1
#define _I2C1PIE_ADR1IE_LENGTH                              0x1
#define _I2C1PIE_ADR1IE_MASK                                0x8
#define _I2C1PIE_WR1IE_POSN                                 0x4
#define _I2C1PIE_WR1IE_POSITION                             0x4
#define _I2C1PIE_WR1IE_SIZE                                 0x1
#define _I2C1PIE_WR1IE_LENGTH                               0x1
#define _I2C1PIE_WR1IE_MASK                                 0x10
#define _I2C1PIE_ACKT1IE_POSN                               0x6
#define _I2C1PIE_ACKT1IE_POSITION                           0x6
#define _I2C1PIE_ACKT1IE_SIZE                               0x1
#define _I2C1PIE_ACKT1IE_LENGTH                             0x1
#define _I2C1PIE_ACKT1IE_MASK                               0x40
#define _I2C1PIE_CNT1IE_POSN                                0x7
#define _I2C1PIE_CNT1IE_POSITION                            0x7
#define _I2C1PIE_CNT1IE_SIZE                                0x1
#define _I2C1PIE_CNT1IE_LENGTH                              0x1
#define _I2C1PIE_CNT1IE_MASK                                0x80

// Register: I2C1CLK
#define I2C1CLK I2C1CLK
extern volatile unsigned char           I2C1CLK             __at(0x3D7B);
#ifndef _LIB_BUILD
asm("I2C1CLK equ 03D7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned I2CCLK                 :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
    struct {
        unsigned I2CCLK0                :1;
        unsigned I2CCLK1                :1;
        unsigned I2CCLK2                :1;
        unsigned I2CCLK3                :1;
    };
} I2C1CLKbits_t;
extern volatile I2C1CLKbits_t I2C1CLKbits __at(0x3D7B);
// bitfield macros
#define _I2C1CLK_CLK_POSN                                   0x0
#define _I2C1CLK_CLK_POSITION                               0x0
#define _I2C1CLK_CLK_SIZE                                   0x8
#define _I2C1CLK_CLK_LENGTH                                 0x8
#define _I2C1CLK_CLK_MASK                                   0xFF
#define _I2C1CLK_I2CCLK_POSN                                0x0
#define _I2C1CLK_I2CCLK_POSITION                            0x0
#define _I2C1CLK_I2CCLK_SIZE                                0x8
#define _I2C1CLK_I2CCLK_LENGTH                              0x8
#define _I2C1CLK_I2CCLK_MASK                                0xFF
#define _I2C1CLK_CLK0_POSN                                  0x0
#define _I2C1CLK_CLK0_POSITION                              0x0
#define _I2C1CLK_CLK0_SIZE                                  0x1
#define _I2C1CLK_CLK0_LENGTH                                0x1
#define _I2C1CLK_CLK0_MASK                                  0x1
#define _I2C1CLK_CLK1_POSN                                  0x1
#define _I2C1CLK_CLK1_POSITION                              0x1
#define _I2C1CLK_CLK1_SIZE                                  0x1
#define _I2C1CLK_CLK1_LENGTH                                0x1
#define _I2C1CLK_CLK1_MASK                                  0x2
#define _I2C1CLK_CLK2_POSN                                  0x2
#define _I2C1CLK_CLK2_POSITION                              0x2
#define _I2C1CLK_CLK2_SIZE                                  0x1
#define _I2C1CLK_CLK2_LENGTH                                0x1
#define _I2C1CLK_CLK2_MASK                                  0x4
#define _I2C1CLK_CLK3_POSN                                  0x3
#define _I2C1CLK_CLK3_POSITION                              0x3
#define _I2C1CLK_CLK3_SIZE                                  0x1
#define _I2C1CLK_CLK3_LENGTH                                0x1
#define _I2C1CLK_CLK3_MASK                                  0x8
#define _I2C1CLK_I2CCLK0_POSN                               0x0
#define _I2C1CLK_I2CCLK0_POSITION                           0x0
#define _I2C1CLK_I2CCLK0_SIZE                               0x1
#define _I2C1CLK_I2CCLK0_LENGTH                             0x1
#define _I2C1CLK_I2CCLK0_MASK                               0x1
#define _I2C1CLK_I2CCLK1_POSN                               0x1
#define _I2C1CLK_I2CCLK1_POSITION                           0x1
#define _I2C1CLK_I2CCLK1_SIZE                               0x1
#define _I2C1CLK_I2CCLK1_LENGTH                             0x1
#define _I2C1CLK_I2CCLK1_MASK                               0x2
#define _I2C1CLK_I2CCLK2_POSN                               0x2
#define _I2C1CLK_I2CCLK2_POSITION                           0x2
#define _I2C1CLK_I2CCLK2_SIZE                               0x1
#define _I2C1CLK_I2CCLK2_LENGTH                             0x1
#define _I2C1CLK_I2CCLK2_MASK                               0x4
#define _I2C1CLK_I2CCLK3_POSN                               0x3
#define _I2C1CLK_I2CCLK3_POSITION                           0x3
#define _I2C1CLK_I2CCLK3_SIZE                               0x1
#define _I2C1CLK_I2CCLK3_LENGTH                             0x1
#define _I2C1CLK_I2CCLK3_MASK                               0x8

