GopalSaraf/Practicals/PSDL/include/proc/pic18f45k42.h
#define                                 RB7PPS5_bit         _BIT_ACCESS(RB7PPS,5)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x1FE60);	// @ (0x3FCC * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// RC0PPS<RC0PPS0>
extern volatile __bit                   RC0PPS0             __at(0x1D080);	// @ (0x3A10 * 8 + 0)
#define                                 RC0PPS0_bit         _BIT_ACCESS(RC0PPS,0)
// RC0PPS<RC0PPS1>
extern volatile __bit                   RC0PPS1             __at(0x1D081);	// @ (0x3A10 * 8 + 1)
#define                                 RC0PPS1_bit         _BIT_ACCESS(RC0PPS,1)
// RC0PPS<RC0PPS2>
extern volatile __bit                   RC0PPS2             __at(0x1D082);	// @ (0x3A10 * 8 + 2)
#define                                 RC0PPS2_bit         _BIT_ACCESS(RC0PPS,2)
// RC0PPS<RC0PPS3>
extern volatile __bit                   RC0PPS3             __at(0x1D083);	// @ (0x3A10 * 8 + 3)
#define                                 RC0PPS3_bit         _BIT_ACCESS(RC0PPS,3)
// RC0PPS<RC0PPS4>
extern volatile __bit                   RC0PPS4             __at(0x1D084);	// @ (0x3A10 * 8 + 4)
#define                                 RC0PPS4_bit         _BIT_ACCESS(RC0PPS,4)
// RC0PPS<RC0PPS5>
extern volatile __bit                   RC0PPS5             __at(0x1D085);	// @ (0x3A10 * 8 + 5)
#define                                 RC0PPS5_bit         _BIT_ACCESS(RC0PPS,5)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x1FE61);	// @ (0x3FCC * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// RC1PPS<RC1PPS0>
extern volatile __bit                   RC1PPS0             __at(0x1D088);	// @ (0x3A11 * 8 + 0)
#define                                 RC1PPS0_bit         _BIT_ACCESS(RC1PPS,0)
// RC1PPS<RC1PPS1>
extern volatile __bit                   RC1PPS1             __at(0x1D089);	// @ (0x3A11 * 8 + 1)
#define                                 RC1PPS1_bit         _BIT_ACCESS(RC1PPS,1)
// RC1PPS<RC1PPS2>
extern volatile __bit                   RC1PPS2             __at(0x1D08A);	// @ (0x3A11 * 8 + 2)
#define                                 RC1PPS2_bit         _BIT_ACCESS(RC1PPS,2)
// RC1PPS<RC1PPS3>
extern volatile __bit                   RC1PPS3             __at(0x1D08B);	// @ (0x3A11 * 8 + 3)
#define                                 RC1PPS3_bit         _BIT_ACCESS(RC1PPS,3)
// RC1PPS<RC1PPS4>
extern volatile __bit                   RC1PPS4             __at(0x1D08C);	// @ (0x3A11 * 8 + 4)
#define                                 RC1PPS4_bit         _BIT_ACCESS(RC1PPS,4)
// RC1PPS<RC1PPS5>
extern volatile __bit                   RC1PPS5             __at(0x1D08D);	// @ (0x3A11 * 8 + 5)
#define                                 RC1PPS5_bit         _BIT_ACCESS(RC1PPS,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x1FE62);	// @ (0x3FCC * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// RC2PPS<RC2PPS0>
extern volatile __bit                   RC2PPS0             __at(0x1D090);	// @ (0x3A12 * 8 + 0)
#define                                 RC2PPS0_bit         _BIT_ACCESS(RC2PPS,0)
// RC2PPS<RC2PPS1>
extern volatile __bit                   RC2PPS1             __at(0x1D091);	// @ (0x3A12 * 8 + 1)
#define                                 RC2PPS1_bit         _BIT_ACCESS(RC2PPS,1)
// RC2PPS<RC2PPS2>
extern volatile __bit                   RC2PPS2             __at(0x1D092);	// @ (0x3A12 * 8 + 2)
#define                                 RC2PPS2_bit         _BIT_ACCESS(RC2PPS,2)
// RC2PPS<RC2PPS3>
extern volatile __bit                   RC2PPS3             __at(0x1D093);	// @ (0x3A12 * 8 + 3)
#define                                 RC2PPS3_bit         _BIT_ACCESS(RC2PPS,3)
// RC2PPS<RC2PPS4>
extern volatile __bit                   RC2PPS4             __at(0x1D094);	// @ (0x3A12 * 8 + 4)
#define                                 RC2PPS4_bit         _BIT_ACCESS(RC2PPS,4)
// RC2PPS<RC2PPS5>
extern volatile __bit                   RC2PPS5             __at(0x1D095);	// @ (0x3A12 * 8 + 5)
#define                                 RC2PPS5_bit         _BIT_ACCESS(RC2PPS,5)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x1FE63);	// @ (0x3FCC * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// RC3PPS<RC3PPS0>
extern volatile __bit                   RC3PPS0             __at(0x1D098);	// @ (0x3A13 * 8 + 0)
#define                                 RC3PPS0_bit         _BIT_ACCESS(RC3PPS,0)
// RC3PPS<RC3PPS1>
extern volatile __bit                   RC3PPS1             __at(0x1D099);	// @ (0x3A13 * 8 + 1)
#define                                 RC3PPS1_bit         _BIT_ACCESS(RC3PPS,1)
// RC3PPS<RC3PPS2>
extern volatile __bit                   RC3PPS2             __at(0x1D09A);	// @ (0x3A13 * 8 + 2)
#define                                 RC3PPS2_bit         _BIT_ACCESS(RC3PPS,2)
// RC3PPS<RC3PPS3>
extern volatile __bit                   RC3PPS3             __at(0x1D09B);	// @ (0x3A13 * 8 + 3)
#define                                 RC3PPS3_bit         _BIT_ACCESS(RC3PPS,3)
// RC3PPS<RC3PPS4>
extern volatile __bit                   RC3PPS4             __at(0x1D09C);	// @ (0x3A13 * 8 + 4)
#define                                 RC3PPS4_bit         _BIT_ACCESS(RC3PPS,4)
// RC3PPS<RC3PPS5>
extern volatile __bit                   RC3PPS5             __at(0x1D09D);	// @ (0x3A13 * 8 + 5)
#define                                 RC3PPS5_bit         _BIT_ACCESS(RC3PPS,5)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x1FE64);	// @ (0x3FCC * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0x1D0A0);	// @ (0x3A14 * 8 + 0)
#define                                 RC4PPS0_bit         _BIT_ACCESS(RC4PPS,0)
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0x1D0A1);	// @ (0x3A14 * 8 + 1)
#define                                 RC4PPS1_bit         _BIT_ACCESS(RC4PPS,1)
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0x1D0A2);	// @ (0x3A14 * 8 + 2)
#define                                 RC4PPS2_bit         _BIT_ACCESS(RC4PPS,2)
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0x1D0A3);	// @ (0x3A14 * 8 + 3)
#define                                 RC4PPS3_bit         _BIT_ACCESS(RC4PPS,3)
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0x1D0A4);	// @ (0x3A14 * 8 + 4)
#define                                 RC4PPS4_bit         _BIT_ACCESS(RC4PPS,4)
// RC4PPS<RC4PPS5>
extern volatile __bit                   RC4PPS5             __at(0x1D0A5);	// @ (0x3A14 * 8 + 5)
#define                                 RC4PPS5_bit         _BIT_ACCESS(RC4PPS,5)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x1FE65);	// @ (0x3FCC * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// RC5PPS<RC5PPS0>
extern volatile __bit                   RC5PPS0             __at(0x1D0A8);	// @ (0x3A15 * 8 + 0)
#define                                 RC5PPS0_bit         _BIT_ACCESS(RC5PPS,0)
// RC5PPS<RC5PPS1>
extern volatile __bit                   RC5PPS1             __at(0x1D0A9);	// @ (0x3A15 * 8 + 1)
#define                                 RC5PPS1_bit         _BIT_ACCESS(RC5PPS,1)
// RC5PPS<RC5PPS2>
extern volatile __bit                   RC5PPS2             __at(0x1D0AA);	// @ (0x3A15 * 8 + 2)
#define                                 RC5PPS2_bit         _BIT_ACCESS(RC5PPS,2)
// RC5PPS<RC5PPS3>
extern volatile __bit                   RC5PPS3             __at(0x1D0AB);	// @ (0x3A15 * 8 + 3)
#define                                 RC5PPS3_bit         _BIT_ACCESS(RC5PPS,3)
// RC5PPS<RC5PPS4>
extern volatile __bit                   RC5PPS4             __at(0x1D0AC);	// @ (0x3A15 * 8 + 4)
#define                                 RC5PPS4_bit         _BIT_ACCESS(RC5PPS,4)
// RC5PPS<RC5PPS5>
extern volatile __bit                   RC5PPS5             __at(0x1D0AD);	// @ (0x3A15 * 8 + 5)
#define                                 RC5PPS5_bit         _BIT_ACCESS(RC5PPS,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x1FE66);	// @ (0x3FCC * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// RC6PPS<RC6PPS0>
extern volatile __bit                   RC6PPS0             __at(0x1D0B0);	// @ (0x3A16 * 8 + 0)
#define                                 RC6PPS0_bit         _BIT_ACCESS(RC6PPS,0)
// RC6PPS<RC6PPS1>
extern volatile __bit                   RC6PPS1             __at(0x1D0B1);	// @ (0x3A16 * 8 + 1)
#define                                 RC6PPS1_bit         _BIT_ACCESS(RC6PPS,1)
// RC6PPS<RC6PPS2>
extern volatile __bit                   RC6PPS2             __at(0x1D0B2);	// @ (0x3A16 * 8 + 2)
#define                                 RC6PPS2_bit         _BIT_ACCESS(RC6PPS,2)
// RC6PPS<RC6PPS3>
extern volatile __bit                   RC6PPS3             __at(0x1D0B3);	// @ (0x3A16 * 8 + 3)
#define                                 RC6PPS3_bit         _BIT_ACCESS(RC6PPS,3)
// RC6PPS<RC6PPS4>
extern volatile __bit                   RC6PPS4             __at(0x1D0B4);	// @ (0x3A16 * 8 + 4)
#define                                 RC6PPS4_bit         _BIT_ACCESS(RC6PPS,4)
// RC6PPS<RC6PPS5>
extern volatile __bit                   RC6PPS5             __at(0x1D0B5);	// @ (0x3A16 * 8 + 5)
#define                                 RC6PPS5_bit         _BIT_ACCESS(RC6PPS,5)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x1FE67);	// @ (0x3FCC * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RC7PPS<RC7PPS0>
extern volatile __bit                   RC7PPS0             __at(0x1D0B8);	// @ (0x3A17 * 8 + 0)
#define                                 RC7PPS0_bit         _BIT_ACCESS(RC7PPS,0)
// RC7PPS<RC7PPS1>
extern volatile __bit                   RC7PPS1             __at(0x1D0B9);	// @ (0x3A17 * 8 + 1)
#define                                 RC7PPS1_bit         _BIT_ACCESS(RC7PPS,1)
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0x1D0BA);	// @ (0x3A17 * 8 + 2)
#define                                 RC7PPS2_bit         _BIT_ACCESS(RC7PPS,2)
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0x1D0BB);	// @ (0x3A17 * 8 + 3)
#define                                 RC7PPS3_bit         _BIT_ACCESS(RC7PPS,3)
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0x1D0BC);	// @ (0x3A17 * 8 + 4)
#define                                 RC7PPS4_bit         _BIT_ACCESS(RC7PPS,4)
// RC7PPS<RC7PPS5>
extern volatile __bit                   RC7PPS5             __at(0x1D0BD);	// @ (0x3A17 * 8 + 5)
#define                                 RC7PPS5_bit         _BIT_ACCESS(RC7PPS,5)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x1CF28);	// @ (0x39E5 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x1FE68);	// @ (0x3FCD * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// RD0PPS<RD0PPS0>
extern volatile __bit                   RD0PPS0             __at(0x1D0C0);	// @ (0x3A18 * 8 + 0)
#define                                 RD0PPS0_bit         _BIT_ACCESS(RD0PPS,0)
// RD0PPS<RD0PPS1>
extern volatile __bit                   RD0PPS1             __at(0x1D0C1);	// @ (0x3A18 * 8 + 1)
#define                                 RD0PPS1_bit         _BIT_ACCESS(RD0PPS,1)
// RD0PPS<RD0PPS2>
extern volatile __bit                   RD0PPS2             __at(0x1D0C2);	// @ (0x3A18 * 8 + 2)
#define                                 RD0PPS2_bit         _BIT_ACCESS(RD0PPS,2)
// RD0PPS<RD0PPS3>
extern volatile __bit                   RD0PPS3             __at(0x1D0C3);	// @ (0x3A18 * 8 + 3)
#define                                 RD0PPS3_bit         _BIT_ACCESS(RD0PPS,3)
// RD0PPS<RD0PPS4>
extern volatile __bit                   RD0PPS4             __at(0x1D0C4);	// @ (0x3A18 * 8 + 4)
#define                                 RD0PPS4_bit         _BIT_ACCESS(RD0PPS,4)
// RD0PPS<RD0PPS5>
extern volatile __bit                   RD0PPS5             __at(0x1D0C5);	// @ (0x3A18 * 8 + 5)
#define                                 RD0PPS5_bit         _BIT_ACCESS(RD0PPS,5)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x1FE69);	// @ (0x3FCD * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1FD91);	// @ (0x3FB2 * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x1FD31);	// @ (0x3FA6 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x1FCD1);	// @ (0x3F9A * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// RD1PPS<RD1PPS0>
extern volatile __bit                   RD1PPS0             __at(0x1D0C8);	// @ (0x3A19 * 8 + 0)
#define                                 RD1PPS0_bit         _BIT_ACCESS(RD1PPS,0)
// RD1PPS<RD1PPS1>
extern volatile __bit                   RD1PPS1             __at(0x1D0C9);	// @ (0x3A19 * 8 + 1)
#define                                 RD1PPS1_bit         _BIT_ACCESS(RD1PPS,1)
// RD1PPS<RD1PPS2>
extern volatile __bit                   RD1PPS2             __at(0x1D0CA);	// @ (0x3A19 * 8 + 2)
#define                                 RD1PPS2_bit         _BIT_ACCESS(RD1PPS,2)
// RD1PPS<RD1PPS3>
extern volatile __bit                   RD1PPS3             __at(0x1D0CB);	// @ (0x3A19 * 8 + 3)
#define                                 RD1PPS3_bit         _BIT_ACCESS(RD1PPS,3)
// RD1PPS<RD1PPS4>
extern volatile __bit                   RD1PPS4             __at(0x1D0CC);	// @ (0x3A19 * 8 + 4)
#define                                 RD1PPS4_bit         _BIT_ACCESS(RD1PPS,4)
// RD1PPS<RD1PPS5>
extern volatile __bit                   RD1PPS5             __at(0x1D0CD);	// @ (0x3A19 * 8 + 5)
#define                                 RD1PPS5_bit         _BIT_ACCESS(RD1PPS,5)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x1FE6A);	// @ (0x3FCD * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// RD2PPS<RD2PPS0>
extern volatile __bit                   RD2PPS0             __at(0x1D0D0);	// @ (0x3A1A * 8 + 0)
#define                                 RD2PPS0_bit         _BIT_ACCESS(RD2PPS,0)
// RD2PPS<RD2PPS1>
extern volatile __bit                   RD2PPS1             __at(0x1D0D1);	// @ (0x3A1A * 8 + 1)
#define                                 RD2PPS1_bit         _BIT_ACCESS(RD2PPS,1)
// RD2PPS<RD2PPS2>
extern volatile __bit                   RD2PPS2             __at(0x1D0D2);	// @ (0x3A1A * 8 + 2)
#define                                 RD2PPS2_bit         _BIT_ACCESS(RD2PPS,2)
// RD2PPS<RD2PPS3>
extern volatile __bit                   RD2PPS3             __at(0x1D0D3);	// @ (0x3A1A * 8 + 3)
#define                                 RD2PPS3_bit         _BIT_ACCESS(RD2PPS,3)
// RD2PPS<RD2PPS4>
extern volatile __bit                   RD2PPS4             __at(0x1D0D4);	// @ (0x3A1A * 8 + 4)
#define                                 RD2PPS4_bit         _BIT_ACCESS(RD2PPS,4)
// RD2PPS<RD2PPS5>
extern volatile __bit                   RD2PPS5             __at(0x1D0D5);	// @ (0x3A1A * 8 + 5)
#define                                 RD2PPS5_bit         _BIT_ACCESS(RD2PPS,5)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x1FE6B);	// @ (0x3FCD * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// RD3PPS<RD3PPS0>
extern volatile __bit                   RD3PPS0             __at(0x1D0D8);	// @ (0x3A1B * 8 + 0)
#define                                 RD3PPS0_bit         _BIT_ACCESS(RD3PPS,0)
// RD3PPS<RD3PPS1>
extern volatile __bit                   RD3PPS1             __at(0x1D0D9);	// @ (0x3A1B * 8 + 1)
#define                                 RD3PPS1_bit         _BIT_ACCESS(RD3PPS,1)
// RD3PPS<RD3PPS2>
extern volatile __bit                   RD3PPS2             __at(0x1D0DA);	// @ (0x3A1B * 8 + 2)
#define                                 RD3PPS2_bit         _BIT_ACCESS(RD3PPS,2)
// RD3PPS<RD3PPS3>
extern volatile __bit                   RD3PPS3             __at(0x1D0DB);	// @ (0x3A1B * 8 + 3)
#define                                 RD3PPS3_bit         _BIT_ACCESS(RD3PPS,3)
// RD3PPS<RD3PPS4>
extern volatile __bit                   RD3PPS4             __at(0x1D0DC);	// @ (0x3A1B * 8 + 4)
#define                                 RD3PPS4_bit         _BIT_ACCESS(RD3PPS,4)
// RD3PPS<RD3PPS5>
extern volatile __bit                   RD3PPS5             __at(0x1D0DD);	// @ (0x3A1B * 8 + 5)
#define                                 RD3PPS5_bit         _BIT_ACCESS(RD3PPS,5)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x1FE6C);	// @ (0x3FCD * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// RD4PPS<RD4PPS0>
extern volatile __bit                   RD4PPS0             __at(0x1D0E0);	// @ (0x3A1C * 8 + 0)
#define                                 RD4PPS0_bit         _BIT_ACCESS(RD4PPS,0)
// RD4PPS<RD4PPS1>
extern volatile __bit                   RD4PPS1             __at(0x1D0E1);	// @ (0x3A1C * 8 + 1)
#define                                 RD4PPS1_bit         _BIT_ACCESS(RD4PPS,1)
// RD4PPS<RD4PPS2>
extern volatile __bit                   RD4PPS2             __at(0x1D0E2);	// @ (0x3A1C * 8 + 2)
#define                                 RD4PPS2_bit         _BIT_ACCESS(RD4PPS,2)
// RD4PPS<RD4PPS3>
extern volatile __bit                   RD4PPS3             __at(0x1D0E3);	// @ (0x3A1C * 8 + 3)
#define                                 RD4PPS3_bit         _BIT_ACCESS(RD4PPS,3)
// RD4PPS<RD4PPS4>
extern volatile __bit                   RD4PPS4             __at(0x1D0E4);	// @ (0x3A1C * 8 + 4)
#define                                 RD4PPS4_bit         _BIT_ACCESS(RD4PPS,4)
// RD4PPS<RD4PPS5>
extern volatile __bit                   RD4PPS5             __at(0x1D0E5);	// @ (0x3A1C * 8 + 5)
#define                                 RD4PPS5_bit         _BIT_ACCESS(RD4PPS,5)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x1FE6D);	// @ (0x3FCD * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// RD5PPS<RD5PPS0>
extern volatile __bit                   RD5PPS0             __at(0x1D0E8);	// @ (0x3A1D * 8 + 0)
#define                                 RD5PPS0_bit         _BIT_ACCESS(RD5PPS,0)
// RD5PPS<RD5PPS1>
extern volatile __bit                   RD5PPS1             __at(0x1D0E9);	// @ (0x3A1D * 8 + 1)
#define                                 RD5PPS1_bit         _BIT_ACCESS(RD5PPS,1)
// RD5PPS<RD5PPS2>
extern volatile __bit                   RD5PPS2             __at(0x1D0EA);	// @ (0x3A1D * 8 + 2)
#define                                 RD5PPS2_bit         _BIT_ACCESS(RD5PPS,2)
// RD5PPS<RD5PPS3>
extern volatile __bit                   RD5PPS3             __at(0x1D0EB);	// @ (0x3A1D * 8 + 3)
#define                                 RD5PPS3_bit         _BIT_ACCESS(RD5PPS,3)
// RD5PPS<RD5PPS4>
extern volatile __bit                   RD5PPS4             __at(0x1D0EC);	// @ (0x3A1D * 8 + 4)
#define                                 RD5PPS4_bit         _BIT_ACCESS(RD5PPS,4)
// RD5PPS<RD5PPS5>
extern volatile __bit                   RD5PPS5             __at(0x1D0ED);	// @ (0x3A1D * 8 + 5)
#define                                 RD5PPS5_bit         _BIT_ACCESS(RD5PPS,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x1FE6E);	// @ (0x3FCD * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// RD6PPS<RD6PPS0>
extern volatile __bit                   RD6PPS0             __at(0x1D0F0);	// @ (0x3A1E * 8 + 0)
#define                                 RD6PPS0_bit         _BIT_ACCESS(RD6PPS,0)
// RD6PPS<RD6PPS1>
extern volatile __bit                   RD6PPS1             __at(0x1D0F1);	// @ (0x3A1E * 8 + 1)
#define                                 RD6PPS1_bit         _BIT_ACCESS(RD6PPS,1)
// RD6PPS<RD6PPS2>
extern volatile __bit                   RD6PPS2             __at(0x1D0F2);	// @ (0x3A1E * 8 + 2)
#define                                 RD6PPS2_bit         _BIT_ACCESS(RD6PPS,2)
// RD6PPS<RD6PPS3>
extern volatile __bit                   RD6PPS3             __at(0x1D0F3);	// @ (0x3A1E * 8 + 3)
#define                                 RD6PPS3_bit         _BIT_ACCESS(RD6PPS,3)
// RD6PPS<RD6PPS4>
extern volatile __bit                   RD6PPS4             __at(0x1D0F4);	// @ (0x3A1E * 8 + 4)
#define                                 RD6PPS4_bit         _BIT_ACCESS(RD6PPS,4)
// RD6PPS<RD6PPS5>
extern volatile __bit                   RD6PPS5             __at(0x1D0F5);	// @ (0x3A1E * 8 + 5)
#define                                 RD6PPS5_bit         _BIT_ACCESS(RD6PPS,5)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x1FE6F);	// @ (0x3FCD * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// RD7PPS<RD7PPS0>
extern volatile __bit                   RD7PPS0             __at(0x1D0F8);	// @ (0x3A1F * 8 + 0)
#define                                 RD7PPS0_bit         _BIT_ACCESS(RD7PPS,0)
// RD7PPS<RD7PPS1>
extern volatile __bit                   RD7PPS1             __at(0x1D0F9);	// @ (0x3A1F * 8 + 1)
#define                                 RD7PPS1_bit         _BIT_ACCESS(RD7PPS,1)
// RD7PPS<RD7PPS2>
extern volatile __bit                   RD7PPS2             __at(0x1D0FA);	// @ (0x3A1F * 8 + 2)
#define                                 RD7PPS2_bit         _BIT_ACCESS(RD7PPS,2)
// RD7PPS<RD7PPS3>
extern volatile __bit                   RD7PPS3             __at(0x1D0FB);	// @ (0x3A1F * 8 + 3)
#define                                 RD7PPS3_bit         _BIT_ACCESS(RD7PPS,3)
// RD7PPS<RD7PPS4>
extern volatile __bit                   RD7PPS4             __at(0x1D0FC);	// @ (0x3A1F * 8 + 4)
#define                                 RD7PPS4_bit         _BIT_ACCESS(RD7PPS,4)
// RD7PPS<RD7PPS5>
extern volatile __bit                   RD7PPS5             __at(0x1D0FD);	// @ (0x3A1F * 8 + 5)
#define                                 RD7PPS5_bit         _BIT_ACCESS(RD7PPS,5)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x1FE70);	// @ (0x3FCE * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// RE0PPS<RE0PPS0>
extern volatile __bit                   RE0PPS0             __at(0x1D100);	// @ (0x3A20 * 8 + 0)
#define                                 RE0PPS0_bit         _BIT_ACCESS(RE0PPS,0)
// RE0PPS<RE0PPS1>
extern volatile __bit                   RE0PPS1             __at(0x1D101);	// @ (0x3A20 * 8 + 1)
#define                                 RE0PPS1_bit         _BIT_ACCESS(RE0PPS,1)
// RE0PPS<RE0PPS2>
extern volatile __bit                   RE0PPS2             __at(0x1D102);	// @ (0x3A20 * 8 + 2)
#define                                 RE0PPS2_bit         _BIT_ACCESS(RE0PPS,2)
// RE0PPS<RE0PPS3>
extern volatile __bit                   RE0PPS3             __at(0x1D103);	// @ (0x3A20 * 8 + 3)
#define                                 RE0PPS3_bit         _BIT_ACCESS(RE0PPS,3)
// RE0PPS<RE0PPS4>
